Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationOutOfSizeCondition Property
 The fabrication part size is not within the correct size range for the service button condition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationOutOfSizeCondition { get; }
Public Shared ReadOnly Property FabricationOutOfSizeCondition As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationOutOfSizeCondition {
	FailureDefinitionId^ get ();
}
static member FabricationOutOfSizeCondition : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace